# 05_数字类型，用来表示数字。数字类型是数据类型的一个大类，另外还包括字符串、布尔类型
# 数字类型包括整数、浮点数、复数
# 整数：用来表示整数，如1,2,3,4,5,6,7,8,9,10
# 浮点数：用来表示小数，如1.2,3.4,5.6,7.8,9.0
# 复数：用来表示复数，如1+2j,3+4j,5+6j,7+8j,9+10j

# 整数类型：int
# python中只有int一种证书类型，没有long类型
print('整数类型：int')
i = 1
print('i:', i)
k = -100
print('k:', k)

print('==============================')
print('浮点数类型：float')
# 浮点数类型：float
# 浮点类型标识小数，在python中没有double类型，只有float类型
f = 1.23
print('f:', f)
f2 = 1.23e3      # 1.23 * 10^3 科学计数法
print('f2:', f2)
f3 = 1.23e-3      # 1.23 * 10^-3 科学计数法
print('f3:', f3)
f4 = -1.23
print('f4:', f4)

print('==============================')
print('复数类型：complex')
# 复数类型：complex
c = 1.23j
print('c:', c)
c2 = 1.23e3j
print('c2:', c2)
c3 = 1.23e-3j
print('c3:', c3)
c4 = -1.23j
print('c4:', c4)
c5 = c + c2
print('c5:', c5)