# 数学相关函数
# abs        绝对值
# round      四舍六入，五取偶(偶数不进位，奇数进位)（银行家算法）
# pow        次方
# divmod     商和余数


# abs
print(f'绝对值：{abs(-1)}')

# round 四舍六入 五去偶，注意二进制存储精度
print('round')
print(f'{round(4.3)}')  # 4
print(f'{round(4.5)}')  # 4
print(f'{round(4.5111)}')  # 5
print(f'{round(5.5)}')  # 6
print(f'{round(5.6)}')  # 6

print(f'{round(4.5111, 1)}')  # 4.5
print(f'{round(4.5511, 1)}')  # 4.6
print(f'{round(4.6511, 1)}')  # 4.6  ==> 4.7 ， 因为5的后面不是0，有百分位，千分位，明显靠近4.7，这种情况会按四舍五入普通规则
print(f'{round(4.65, 1)}')  # 4.6    ==> 4.7    这里虽然5后面是0，但实际二进制存储不确定，是4.65000000000000035527，所以会进1,
print(f'{4.65:.20f}')

# 上面由于二进制存储不精确，导致无法验证多位小数的五取偶，这里出一系列精确的二进制存储的多位小数
# 二进制能够精确存储分母为2的幂次方数的数，比如 1/2, 1/4, 1/8....
print(f'{round(4.55, 1)}')
print(f'{round(4.25, 1)}')

# pow 次方, 还可同时取模
# 2的3次方
print(f'{2 ** 3}')
print(f'{pow(2, 3)}')
# 2的-1次方
print(f'{pow(2, -1)}')
# 2的开方
print(f'{pow(2, 0.5)}')
# 2的0次方
print(f'{pow(2, 0)}')
# 求次方同时取模
print(f'{pow(2, 3, 3)}')

# divmod 商余
print(f'{10 / 3}')
print(f'{10 // 3}')
print(f'{10 % 3}')
print(f'{divmod(10, 3)}')
